export type tGroup = {
    "Средняя цена": number,
    "Группа": string | number,
    "Максимальная цена": number ,
    "Минимальная цена": number ,
  }[];

export const  categories: tGroup = [
    {
        "Средняя цена": 51.84993157894737,
        "Группа": "Confections",
        "Максимальная цена": 96.0,
        "Минимальная цена": 7.0
    },
    {
        "Средняя цена": 44.27278333333334,
        "Группа": "Shell fish",
        "Максимальная цена": 94.0,
        "Минимальная цена": 1.0
    },
    {
        "Средняя цена": 50.416388888888896,
        "Группа": "Cereals",
        "Максимальная цена": 100.0,
        "Минимальная цена": 1.0
    },
    {
        "Средняя цена": 53.55683142857143,
        "Группа": "Dairy",
        "Максимальная цена": 99.0,
        "Минимальная цена": 1.0
    },
    {
        "Средняя цена": 51.043684210526315,
        "Группа": "Beverages",
        "Максимальная цена": 99.0,
        "Минимальная цена": 3.0
    },
    {
        "Средняя цена": 48.66665555555556,
        "Группа": "Seafood",
        "Максимальная цена": 97.0,
        "Минимальная цена": 0.0
    },
    {
        "Средняя цена": 52.274651999999996,
        "Группа": "Meat",
        "Максимальная цена": 99.0,
        "Минимальная цена": 3.0
    },
    {
        "Средняя цена": 61.40394642857143,
        "Группа": "Grain",
        "Максимальная цена": 97.0,
        "Минимальная цена": 4.0
    },
    {
        "Средняя цена": 49.460882978723404,
        "Группа": "Poultry",
        "Максимальная цена": 98.0,
        "Минимальная цена": 2.0
    },
    {
        "Средняя цена": 53.19933243243243,
        "Группа": "Snails",
        "Максимальная цена": 98.0,
        "Минимальная цена": 8.0
    },
    {
        "Средняя цена": 45.396100000000004,
        "Группа": "Produce",
        "Максимальная цена": 84.0,
        "Минимальная цена": 0.0
    },
    ];


export const cities: tGroup = [
    {
        "Средняя цена": 8.0069,
        "Группа": "Colorado",
        "Максимальная цена": 8.0,
        "Минимальная цена": 8.0
    },
    {
        "Средняя цена": 90.7877,
        "Группа": "Lincoln",
        "Максимальная цена": 91.0,
        "Минимальная цена": 91.0
    },
    {
        "Средняя цена": 90.7877,
        "Группа": "San Francisco",
        "Максимальная цена": 91.0,
        "Минимальная цена": 91.0
    },
    {
        "Средняя цена": 65.6303,
        "Группа": "Kansas",
        "Максимальная цена": 66.0,
        "Минимальная цена": 66.0
    },
    {
        "Средняя цена": 90.0169,
        "Группа": "Tulsa",
        "Максимальная цена": 90.0,
        "Минимальная цена": 90.0
    },
    {
        "Средняя цена": 70.8596,
        "Группа": "Garland",
        "Максимальная цена": 71.0,
        "Минимальная цена": 71.0
    }
];


export const vitality: tGroup = [
    {
        "Средняя цена": 53.04237627737226,
        "Группа": 0,
        "Максимальная цена": 100.0,
        "Минимальная цена": 0.0
    },
    {
        "Средняя цена": 65.9516,
        "Группа": 5,
        "Максимальная цена": 95.0,
        "Минимальная цена": 25.0
    },
    {
        "Средняя цена": 76.3275,
        "Группа": 6,
        "Максимальная цена": 76.0,
        "Минимальная цена": 76.0
    },
    {
        "Средняя цена": 42.74256,
        "Группа": 7,
        "Максимальная цена": 75.0,
        "Минимальная цена": 12.0
    },
    {
        "Средняя цена": 86.1338,
        "Группа": 8,
        "Максимальная цена": 86.0,
        "Минимальная цена": 86.0
    },
    {
        "Средняя цена": 60.4803,
        "Группа": 10,
        "Максимальная цена": 87.0,
        "Минимальная цена": 34.0
    },
    {
        "Средняя цена": 26.88173333333333,
        "Группа": 11,
        "Максимальная цена": 40.0,
        "Минимальная цена": 8.0
    },
    {
        "Средняя цена": 51.2734,
        "Группа": 12,
        "Максимальная цена": 59.0,
        "Минимальная цена": 43.0
    },
    {
        "Средняя цена": 43.81755,
        "Группа": 13,
        "Максимальная цена": 68.0,
        "Минимальная цена": 20.0
    },
    {
        "Средняя цена": 8.7335,
        "Группа": 15,
        "Максимальная цена": 9.0,
        "Минимальная цена": 9.0
    },
    {
        "Средняя цена": 72.21735,
        "Группа": 16,
        "Максимальная цена": 76.0,
        "Минимальная цена": 68.0
    },
    {
        "Средняя цена": 61.4076,
        "Группа": 18,
        "Максимальная цена": 81.0,
        "Минимальная цена": 49.0
    },
    {
        "Средняя цена": 46.123075,
        "Группа": 19,
        "Максимальная цена": 91.0,
        "Минимальная цена": 14.0
    },
    {
        "Средняя цена": 11.6217,
        "Группа": 24,
        "Максимальная цена": 12.0,
        "Минимальная цена": 12.0
    },
    {
        "Средняя цена": 67.9063,
        "Группа": 25,
        "Максимальная цена": 68.0,
        "Минимальная цена": 68.0
    },
    {
        "Средняя цена": 52.10403333333334,
        "Группа": 26,
        "Максимальная цена": 84.0,
        "Минимальная цена": 14.0
    },
    {
        "Средняя цена": 43.59473333333333,
        "Группа": 27,
        "Максимальная цена": 65.0,
        "Минимальная цена": 31.0
    },
    {
        "Средняя цена": 57.06243333333333,
        "Группа": 29,
        "Максимальная цена": 71.0,
        "Минимальная цена": 40.0
    },
    {
        "Средняя цена": 51.15513333333333,
        "Группа": 31,
        "Максимальная цена": 85.0,
        "Минимальная цена": 27.0
    },
    {
        "Средняя цена": 18.9757,
        "Группа": 32,
        "Максимальная цена": 19.0,
        "Минимальная цена": 19.0
    },
    {
        "Средняя цена": 98.8263,
        "Группа": 33,
        "Максимальная цена": 99.0,
        "Минимальная цена": 99.0
    },
    {
        "Средняя цена": 54.1413,
        "Группа": 34,
        "Максимальная цена": 54.0,
        "Минимальная цена": 54.0
    },
    {
        "Средняя цена": 76.3656,
        "Группа": 35,
        "Максимальная цена": 97.0,
        "Минимальная цена": 56.0
    },
    {
        "Средняя цена": 40.141999999999996,
        "Группа": 37,
        "Максимальная цена": 69.0,
        "Минимальная цена": 11.0
    },
    {
        "Средняя цена": 70.5891,
        "Группа": 39,
        "Максимальная цена": 71.0,
        "Минимальная цена": 71.0
    },
    {
        "Средняя цена": 48.4195,
        "Группа": 40,
        "Максимальная цена": 48.0,
        "Минимальная цена": 48.0
    },
    {
        "Средняя цена": 40.3471,
        "Группа": 41,
        "Максимальная цена": 44.0,
        "Минимальная цена": 36.0
    },
    {
        "Средняя цена": 87.9023,
        "Группа": 42,
        "Максимальная цена": 88.0,
        "Минимальная цена": 88.0
    },
    {
        "Средняя цена": 32.7153,
        "Группа": 44,
        "Максимальная цена": 33.0,
        "Минимальная цена": 33.0
    },
    {
        "Средняя цена": 63.1846,
        "Группа": 45,
        "Максимальная цена": 63.0,
        "Минимальная цена": 63.0
    },
    {
        "Средняя цена": 24.520233333333334,
        "Группа": 48,
        "Максимальная цена": 41.0,
        "Минимальная цена": 5.0
    },
    {
        "Средняя цена": 33.5883,
        "Группа": 50,
        "Максимальная цена": 34.0,
        "Минимальная цена": 34.0
    },
    {
        "Средняя цена": 54.58803333333333,
        "Группа": 51,
        "Максимальная цена": 70.0,
        "Минимальная цена": 41.0
    },
    {
        "Средняя цена": 91.7675,
        "Группа": 52,
        "Максимальная цена": 92.0,
        "Минимальная цена": 92.0
    },
    {
        "Средняя цена": 55.00626666666667,
        "Группа": 54,
        "Максимальная цена": 84.0,
        "Минимальная цена": 26.0
    },
    {
        "Средняя цена": 42.1473,
        "Группа": 56,
        "Максимальная цена": 44.0,
        "Минимальная цена": 40.0
    },
    {
        "Средняя цена": 59.0033,
        "Группа": 58,
        "Максимальная цена": 59.0,
        "Минимальная цена": 59.0
    },
    {
        "Средняя цена": 42.75395,
        "Группа": 60,
        "Максимальная цена": 50.0,
        "Минимальная цена": 35.0
    },
    {
        "Средняя цена": 10.9641,
        "Группа": 61,
        "Максимальная цена": 11.0,
        "Минимальная цена": 11.0
    },
    {
        "Средняя цена": 56.8099,
        "Группа": 63,
        "Максимальная цена": 57.0,
        "Минимальная цена": 57.0
    },
    {
        "Средняя цена": 76.43255,
        "Группа": 65,
        "Максимальная цена": 89.0,
        "Минимальная цена": 64.0
    },
    {
        "Средняя цена": 57.9838,
        "Группа": 66,
        "Максимальная цена": 58.0,
        "Минимальная цена": 58.0
    },
    {
        "Средняя цена": 49.0853,
        "Группа": 67,
        "Максимальная цена": 99.0,
        "Минимальная цена": 6.0
    },
    {
        "Средняя цена": 28.2232,
        "Группа": 69,
        "Максимальная цена": 28.0,
        "Минимальная цена": 28.0
    },
    {
        "Средняя цена": 12.16885,
        "Группа": 70,
        "Максимальная цена": 21.0,
        "Минимальная цена": 4.0
    },
    {
        "Средняя цена": 36.18933333333333,
        "Группа": 71,
        "Максимальная цена": 67.0,
        "Минимальная цена": 5.0
    },
    {
        "Средняя цена": 58.467,
        "Группа": 72,
        "Максимальная цена": 85.0,
        "Минимальная цена": 16.0
    },
    {
        "Средняя цена": 83.5389,
        "Группа": 75,
        "Максимальная цена": 84.0,
        "Минимальная цена": 84.0
    },
    {
        "Средняя цена": 35.0901,
        "Группа": 76,
        "Максимальная цена": 59.0,
        "Минимальная цена": 2.0
    },
    {
        "Средняя цена": 90.0169,
        "Группа": 79,
        "Максимальная цена": 90.0,
        "Минимальная цена": 90.0
    },
    {
        "Средняя цена": 56.21503333333333,
        "Группа": 80,
        "Максимальная цена": 83.0,
        "Минимальная цена": 18.0
    },
    {
        "Средняя цена": 53.79685,
        "Группа": 81,
        "Максимальная цена": 89.0,
        "Минимальная цена": 18.0
    },
    {
        "Средняя цена": 5.6015,
        "Группа": 82,
        "Максимальная цена": 6.0,
        "Минимальная цена": 6.0
    },
    {
        "Средняя цена": 27.8169,
        "Группа": 83,
        "Максимальная цена": 28.0,
        "Минимальная цена": 28.0
    },
    {
        "Средняя цена": 32.341,
        "Группа": 84,
        "Максимальная цена": 46.0,
        "Минимальная цена": 18.0
    },
    {
        "Средняя цена": 6.6182,
        "Группа": 85,
        "Максимальная цена": 7.0,
        "Минимальная цена": 7.0
    },
    {
        "Средняя цена": 17.1724,
        "Группа": 86,
        "Максимальная цена": 17.0,
        "Минимальная цена": 17.0
    },
    {
        "Средняя цена": 28.865899999999996,
        "Группа": 87,
        "Максимальная цена": 83.0,
        "Минимальная цена": 0.0
    },
    {
        "Средняя цена": 53.1483,
        "Группа": 88,
        "Максимальная цена": 56.0,
        "Минимальная цена": 50.0
    },
    {
        "Средняя цена": 36.1182,
        "Группа": 89,
        "Максимальная цена": 52.0,
        "Минимальная цена": 20.0
    },
    {
        "Средняя цена": 58.40573333333333,
        "Группа": 90,
        "Максимальная цена": 81.0,
        "Минимальная цена": 31.0
    },
    {
        "Средняя цена": 36.29725,
        "Группа": 91,
        "Максимальная цена": 78.0,
        "Минимальная цена": 18.0
    },
    {
        "Средняя цена": 90.1157,
        "Группа": 92,
        "Максимальная цена": 90.0,
        "Минимальная цена": 90.0
    },
    {
        "Средняя цена": 65.7033,
        "Группа": 93,
        "Максимальная цена": 80.0,
        "Минимальная цена": 40.0
    },
    {
        "Средняя цена": 34.6771,
        "Группа": 94,
        "Максимальная цена": 66.0,
        "Минимальная цена": 3.0
    },
    {
        "Средняя цена": 39.15195,
        "Группа": 95,
        "Максимальная цена": 66.0,
        "Минимальная цена": 13.0
    },
    {
        "Средняя цена": 44.65603333333333,
        "Группа": 96,
        "Максимальная цена": 69.0,
        "Минимальная цена": 16.0
    },
    {
        "Средняя цена": 39.305325,
        "Группа": 97,
        "Максимальная цена": 62.0,
        "Минимальная цена": 16.0
    },
    {
        "Средняя цена": 68.6688,
        "Группа": 99,
        "Максимальная цена": 83.0,
        "Минимальная цена": 54.0
    },
    {
        "Средняя цена": 41.6386,
        "Группа": 100,
        "Максимальная цена": 42.0,
        "Минимальная цена": 42.0
    },
    {
        "Средняя цена": 4.4216,
        "Группа": 101,
        "Максимальная цена": 4.0,
        "Минимальная цена": 4.0
    },
    {
        "Средняя цена": 37.3296,
        "Группа": 103,
        "Максимальная цена": 62.0,
        "Минимальная цена": 12.0
    },
    {
        "Средняя цена": 20.142933333333332,
        "Группа": 104,
        "Максимальная цена": 45.0,
        "Минимальная цена": 6.0
    },
    {
        "Средняя цена": 82.4523,
        "Группа": 105,
        "Максимальная цена": 96.0,
        "Минимальная цена": 57.0
    },
    {
        "Средняя цена": 41.75025,
        "Группа": 106,
        "Максимальная цена": 73.0,
        "Минимальная цена": 11.0
    },
    {
        "Средняя цена": 71.8302,
        "Группа": 107,
        "Максимальная цена": 72.0,
        "Минимальная цена": 72.0
    },
    {
        "Средняя цена": 48.31015,
        "Группа": 108,
        "Максимальная цена": 90.0,
        "Минимальная цена": 4.0
    },
    {
        "Средняя цена": 38.8037,
        "Группа": 110,
        "Максимальная цена": 39.0,
        "Минимальная цена": 39.0
    },
    {
        "Средняя цена": 23.4085,
        "Группа": 111,
        "Максимальная цена": 38.0,
        "Минимальная цена": 9.0
    },
    {
        "Средняя цена": 85.694,
        "Группа": 113,
        "Максимальная цена": 86.0,
        "Минимальная цена": 86.0
    },
    {
        "Средняя цена": 61.9507,
        "Группа": 114,
        "Максимальная цена": 64.0,
        "Минимальная цена": 60.0
    },
    {
        "Средняя цена": 24.20288,
        "Группа": 116,
        "Максимальная цена": 51.0,
        "Минимальная цена": 4.0
    },
    {
        "Средняя цена": 47.57256666666667,
        "Группа": 117,
        "Максимальная цена": 96.0,
        "Минимальная цена": 3.0
    },
    {
        "Средняя цена": 55.4964,
        "Группа": 118,
        "Максимальная цена": 55.0,
        "Минимальная цена": 55.0
    },
    {
        "Средняя цена": 78.5531,
        "Группа": 120,
        "Максимальная цена": 82.0,
        "Минимальная цена": 75.0
    }
];


export const employees: tGroup = [
    {
        "Средняя цена": 53.69445625,
        "Группа": "Nicole Fuller",
        "Максимальная цена": 99.0,
        "Минимальная цена": 6.0
    },
    {
        "Средняя цена": 47.40727727272727,
        "Группа": "Christine Palmer",
        "Максимальная цена": 95.0,
        "Минимальная цена": 0.0
    },
    {
        "Средняя цена": 59.29029565217391,
        "Группа": "Pablo Cline",
        "Максимальная цена": 96.0,
        "Минимальная цена": 3.0
    },
    {
        "Средняя цена": 56.73010909090909,
        "Группа": "Darnell Nielsen",
        "Максимальная цена": 96.0,
        "Минимальная цена": 6.0
    },
    {
        "Средняя цена": 56.44707368421053,
        "Группа": "Desiree Stuart",
        "Максимальная цена": 100.0,
        "Минимальная цена": 0.0
    },
    {
        "Средняя цена": 46.46387333333333,
        "Группа": "Holly Collins",
        "Максимальная цена": 75.0,
        "Минимальная цена": 9.0
    },
    {
        "Средняя цена": 54.8246064516129,
        "Группа": "Chadwick Cook",
        "Максимальная цена": 97.0,
        "Минимальная цена": 2.0
    },
    {
        "Средняя цена": 54.59147391304348,
        "Группа": "Julie Dyer",
        "Максимальная цена": 96.0,
        "Минимальная цена": 0.0
    },
    {
        "Средняя цена": 46.07251875,
        "Группа": "Daphne King",
        "Максимальная цена": 100.0,
        "Минимальная цена": 0.0
    },
    {
        "Средняя цена": 48.859868,
        "Группа": "Jean Vang",
        "Максимальная цена": 95.0,
        "Минимальная цена": 2.0
    },
    {
        "Средняя цена": 58.691825925925926,
        "Группа": "Sonya Dickson",
        "Максимальная цена": 100.0,
        "Минимальная цена": 9.0
    },
    {
        "Средняя цена": 48.31456153846154,
        "Группа": "Lindsay Chen",
        "Максимальная цена": 99.0,
        "Минимальная цена": 2.0
    },
    {
        "Средняя цена": 50.00708399999999,
        "Группа": "Katina Marks",
        "Максимальная цена": 95.0,
        "Минимальная цена": 2.0
    },
    {
        "Средняя цена": 48.68624166666667,
        "Группа": "Wendi Buckley",
        "Максимальная цена": 94.0,
        "Минимальная цена": 5.0
    },
    {
        "Средняя цена": 49.13146842105263,
        "Группа": "Kari Finley",
        "Максимальная цена": 100.0,
        "Минимальная цена": 1.0
    },
    {
        "Средняя цена": 52.251632,
        "Группа": "Chadwick Walton",
        "Максимальная цена": 96.0,
        "Минимальная цена": 3.0
    },
    {
        "Средняя цена": 54.17747142857143,
        "Группа": "Seth Franco",
        "Максимальная цена": 96.0,
        "Минимальная цена": 7.0
    },
    {
        "Средняя цена": 48.06974193548387,
        "Группа": "Warren Bartlett",
        "Максимальная цена": 91.0,
        "Минимальная цена": 0.0
    },
    {
        "Средняя цена": 50.225668,
        "Группа": "Bernard Moody",
        "Максимальная цена": 96.0,
        "Минимальная цена": 1.0
    },
    {
        "Средняя цена": 49.84342222222222,
        "Группа": "Shelby Riddle",
        "Максимальная цена": 99.0,
        "Минимальная цена": 4.0
    },
    {
        "Средняя цена": 45.57315263157895,
        "Группа": "Devon Brewer",
        "Максимальная цена": 95.0,
        "Минимальная цена": 0.0
    },
    {
        "Средняя цена": 45.78309375,
        "Группа": "Tonia Mc Millan",
        "Максимальная цена": 99.0,
        "Минимальная цена": 3.0
    },
    {
        "Средняя цена": 54.927299999999995,
        "Группа": "Максимальная цена Ms Millan",
        "Максимальная цена": 96.0,
        "Минимальная цена": 1.0
    },
];